starter-kit-yasnippet.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Starter Kit Yasnippet</title>
<!-- 2014-10-13 Mon 22:00 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">Starter Kit Yasnippet</h1>
<p>
This is part of the <a href="starter-kit.html">Emacs Starter Kit</a>.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Starter Kit Yasnippet</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="http://code.google.com/p/yasnippet/">yasnippet</a> is yet another snippet expansion system for Emacs.  It is
inspired by TextMate's templating syntax.
</p>
<ul class="org-ul">
<li>watch the <a href="http://www.youtube.com/watch?v=vOj7btx3ATg">video on YouTube</a>
</li>
<li>see the <a href="http://yasnippet.googlecode.com/svn/trunk/doc/index.html">intro and tutorial</a>
</li>
</ul>
</div>

<div id="outline-container-install" class="outline-3">
<h3 id="install"><a id="sec-1-1" name="sec-1-1"></a>Install Yasnippet</h3>
<div class="outline-text-3" id="text-install">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(starter-kit-install-if-needed 'yasnippet)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">If `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">yasnippet-bundle</span><span style="font-weight: bold; font-style: italic;">' has previously been installed through ELPA,</span>
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">delete it before installing the new `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">yasnippet</span><span style="font-weight: bold; font-style: italic;">'</span>
(<span style="font-weight: bold;">let</span> ((yas-bundle-desc (assq 'yasnippet-bundle package-alist)))
  (<span style="font-weight: bold;">when</span> yas-bundle-desc
    (package-delete <span style="font-style: italic;">"yasnippet-bundle"</span>
                    (package-version-join
                     (package-desc-vers (cdr yas-bundle-desc))))))
</pre>
</div>
</div>
</div>

<div id="outline-container-snippet-paths" class="outline-3">
<h3 id="snippet-paths"><a id="sec-1-2" name="sec-1-2"></a>Put yasnippet directories on the load path</h3>
<div class="outline-text-3" id="text-snippet-paths">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-to-list 'load-path
             (expand-file-name  <span style="font-style: italic;">"yasnippet"</span>
                                (expand-file-name <span style="font-style: italic;">"src"</span>
                                                  starter-kit-dir)))
</pre>
</div>
</div>
</div>

<div id="outline-container-load" class="outline-3">
<h3 id="load"><a id="sec-1-3" name="sec-1-3"></a>Load Yasnippet</h3>
<div class="outline-text-3" id="text-load">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">yasnippet</span>)
(yas-global-mode 1)
</pre>
</div>
</div>
</div>

<div id="outline-container-default-snippets" class="outline-3">
<h3 id="default-snippets"><a id="sec-1-4" name="sec-1-4"></a>Load Snippets Distributed with the Starter Kit</h3>
<div class="outline-text-3" id="text-default-snippets">
<p>
Load the snippets defined in the <code>./snippets/</code> directory.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(yas/load-directory (expand-file-name <span style="font-style: italic;">"snippets"</span> starter-kit-dir))
</pre>
</div>
</div>
</div>

<div id="outline-container-org-mode" class="outline-3">
<h3 id="org-mode"><a id="sec-1-5" name="sec-1-5"></a>Configure Yasnippets for Org Mode</h3>
<div class="outline-text-3" id="text-org-mode">

<p>
The latest version of yasnippets doesn't play well with Org-mode, the
following function allows these two to play nicely together.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">yas/org-very-safe-expand</span> ()
  (<span style="font-weight: bold;">let</span> ((yas/fallback-behavior 'return-nil)) (yas/expand)))

(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">yas/org-setup</span> ()
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">yasnippet (using the new org-cycle hooks)</span>
  (make-variable-buffer-local 'yas/trigger-key)
  (setq yas/trigger-key [tab])
  (add-to-list 'org-tab-first-hook 'yas/org-very-safe-expand)
  (define-key yas/keymap [tab] 'yas/next-field))

(add-hook 'org-mode-hook #'yas/org-setup)
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
